# 9. Your pandas questions answered

In [1]:
import pandas as pd

**1. Reading only two columns (or a specific number of columns)**

In [2]:
ufo = pd.read_csv('data/uforeports.csv', index_col=0)
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca , NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro , NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke , CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene , KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair , NY"

In [3]:
# We can read only the columns we need, by passing a list of there names.
ufo = pd.read_csv('data/uforeports.csv', usecols=['City', 'State'])
ufo.columns

Index(['City', 'State'], dtype='object')

**2. The fastest way of reading from csv file**

In [4]:
# we can read a specific number of rows from a DataFrame by passing a number to the 'nrows' parameter.
ufo = pd.read_csv('data/uforeports.csv', nrows=3)
ufo

,Unnamed: 0,City,Colors Reported,Shape Reported,State,Time,Location
0,0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca , NY"
1,1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro , NJ"
2,2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke , CO"

**3. How do DataFrame and Series work with regard to selecting individual entries and iteration?**

In [5]:
# we can iterate through a pandas Series, same as iteration through a python list.
for c in ufo['City']:
    print(c)

Ithaca
Willingboro
Holyoke

In [6]:
# we can iterate through a pandas DataFrame using 'iterrows()' method.
for index, row in ufo.iterrows():
    print(index, row['City'], row['State'], row['Location'])

0 Ithaca NY Ithaca , NY
1 Willingboro NJ Willingboro , NJ
2 Holyoke CO Holyoke , CO

**4. What's the best way to drop every non-numeric column from a DataFrame?**

In [7]:
drink = pd.read_csv('data/drinksbycountry.csv')
drink.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [8]:
drink.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [9]:
# only include numeric columns in the DataFrame
import numpy as np
drink.select_dtypes(include=[np.number]).dtypes

beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
dtype: object